aidangarske/wolfTrust-fork/port/stm32h563/hsm_flash.c
/* hsm_flash.c
 *
 * Copyright (C) 2026 wolfSSL Inc.
 *
 * This file is part of wolfTrust.
 *
 * wolfTrust is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * wolfTrust is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software
 * Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1335, USA
 */

#include "hsm_flash.h"

#include "memory_map.h"
#include "stm32h563_regs.h"
#include "wolfhsm/wh_error.h"
#include "wolftrust/spm_transport.h"
#include "wolftrust/services/fwu_service.h"
#include "wolftrust/spm_gate.h"
#include "wolftrust/arch.h"

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#define WT_FLASH_KEYR          (*(volatile uint32_t *)(WT_FLASH_BASE_S + 0x08u))
#define WT_FLASH_CR            (*(volatile uint32_t *)(WT_FLASH_BASE_S + 0x2Cu))
#define WT_FLASH_CCR           (*(volatile uint32_t *)(WT_FLASH_BASE_S + 0x34u))
#define WT_FLASH_OPTSR_CUR     (*(volatile uint32_t *)(WT_FLASH_BASE_S + 0x50u))
#define WT_FLASH_ECCDETR       (*(volatile uint32_t *)(WT_FLASH_BASE_S + 0x104u))

#define WT_FLASH_SR_EOP        (1u << 16)
#define WT_FLASH_SR_WRPE       (1u << 17)
#define WT_FLASH_SR_PGSE       (1u << 18)
#define WT_FLASH_SR_STRBE      (1u << 19)
#define WT_FLASH_SR_INCE       (1u << 20)
#define WT_FLASH_SR_OPTE       (1u << 21)
#define WT_FLASH_SR_OPTWE      (1u << 22)
#define WT_FLASH_SR_ALL_ERR    (WT_FLASH_SR_WRPE | WT_FLASH_SR_PGSE | \
                                WT_FLASH_SR_STRBE | WT_FLASH_SR_INCE | \
                                WT_FLASH_SR_OPTE | WT_FLASH_SR_OPTWE)

#define WT_FLASH_CCR_CLR_ALL   (WT_FLASH_SR_DBNE | WT_FLASH_SR_EOP | \
                                WT_FLASH_SR_WRPE | WT_FLASH_SR_PGSE | \
                                WT_FLASH_SR_STRBE | WT_FLASH_SR_INCE | \
                                WT_FLASH_SR_OPTE | WT_FLASH_SR_OPTWE)

#define WT_FLASH_CR_LOCK       (1u << 0)
#define WT_FLASH_CR_PG         (1u << 1)
#define WT_FLASH_CR_SER        (1u << 2)
#define WT_FLASH_CR_BER        (1u << 3)
#define WT_FLASH_CR_STRT       (1u << 5)
#define WT_FLASH_CR_PNB_SHIFT  6u
#define WT_FLASH_CR_PNB_MASK   0x7Fu
#define WT_FLASH_CR_MER        (1u << 15)
#define WT_FLASH_CR_BKSEL      (1u << 31)

#define WT_FLASH_KEY1          0x45670123u
#define WT_FLASH_KEY2          0xCDEF89ABu

/* The H563 ICACHE caches data reads from flash too, so a verify read-back of
 * a just-programmed unit can hit the stale pre-program line; RM0481 requires
 * an invalidate whenever flash content changes under an enabled ICACHE. */
#define WT_ICACHE_CR           (*(volatile uint32_t *)0x50030400u)
#define WT_ICACHE_SR           (*(volatile uint32_t *)0x50030404u)
#define WT_ICACHE_CR_EN        (1u << 0)
#define WT_ICACHE_CR_CACHEINV  (1u << 1)
#define WT_ICACHE_SR_BUSYF     (1u << 0)
#define WT_FLASH_BANK2_BASE_NS 0x08100000u
#define WT_FLASH_TOP_NS        0x081FFFFFu
#define WT_FLASH_BANK_SECTORS  128u
#define WT_FLASH_SWAP_BANK     (1u << 31)
#define WT_FLASH_ECC_ADDR_MASK 0x0000FFFFu
#define WT_FLASH_ECC_BANK      (1u << 22)
#define WT_FLASH_ECCD          (1u << 31)

typedef struct wt_hsm_flash_config {
    uintptr_t base;
    uint32_t size;
    uint32_t sector_size;
    uint32_t program_unit;
} wt_hsm_flash_config_t;

typedef struct wt_hsm_flash_context {
    uintptr_t base;
    uint32_t size;
    uint32_t sector_size;
    uint32_t program_unit;
    bool write_locked;
} wt_hsm_flash_context_t;

static const wt_hsm_flash_config_t g_hsm_flash_cfg = {
    .base = WT_HSM_NVM_FLASH_BASE_S,
    .size = WT_HSM_NVM_FLASH_SIZE,
    .sector_size = WT_FLASH_SECTOR_SIZE,
    .program_unit = 16u,
};

static wt_hsm_flash_context_t g_hsm_flash_ctx;
/* Direct-path forensics (SWD-readable): count every program/erase attempt on
 * the NVM context and latch the first failure's sub-op, offset, and the raw
 * FLASH_SR error bits before they are cleared. */
volatile uint32_t g_wt_flash_prog_calls __attribute__((used));
volatile uint32_t g_wt_flash_erase_calls __attribute__((used));
volatile uint32_t g_wt_flash_first_err __attribute__((used));
volatile uint32_t g_wt_flash_first_err_off __attribute__((used));
volatile uint32_t g_wt_flash_first_err_sr __attribute__((used));
volatile uint32_t g_wt_flash_gate_aborts __attribute__((used));
volatile uint32_t g_wt_flash_gate_abort_info __attribute__((used));
static volatile uint32_t g_flash_ecc_active;
static volatile uint32_t g_flash_ecc_detected;
static volatile uint32_t g_flash_ecc_bank;
static volatile uint32_t g_flash_ecc_start;
static volatile uint32_t g_flash_ecc_end;

static void wt_flash_barrier(void)
{
    __asm__ volatile ("dsb 0xF" ::: "memory");
    __asm__ volatile ("isb 0xF" ::: "memory");
}

static uint32_t wt_irq_save(void)
{
    uint32_t primask;

    __asm__ volatile ("mrs %0, primask" : "=r" (primask));
    __asm__ volatile ("cpsid i" ::: "memory");
    return primask;
}

static void wt_irq_restore(uint32_t primask)
{
    __asm__ volatile ("msr primask, %0" :: "r" (primask) : "memory");
}

void NMI_Handler(void)
{
    uint32_t ecc = WT_FLASH_ECCDETR;
    uint32_t bank = (ecc & WT_FLASH_ECC_BANK) != 0u ? 1u : 0u;
    uint32_t address = ecc & WT_FLASH_ECC_ADDR_MASK;

    if ((ecc & WT_FLASH_ECCD) != 0u && g_flash_ecc_active != 0u &&
        bank == g_flash_ecc_bank && address >= g_flash_ecc_start &&
        address < g_flash_ecc_end) {
        g_flash_ecc_detected = 1u;
        WT_FLASH_ECCDETR |= WT_FLASH_ECCD;
        wt_flash_barrier();
        return;
    }

    for (;;) {
        __asm__ volatile ("wfi");
    }
}

static int wt_flash_read_checked(const uint8_t *source, uint8_t *data,
                                 uint32_t size)
{
    uintptr_t ns_address;
    uint32_t primask;
    uint32_t i;
    int ret = WH_ERROR_OK;

    primask = wt_irq_save();
    ns_address = (uintptr_t)source & ~0x04000000u;
    g_flash_ecc_bank = ns_address >= WT_FLASH_BANK2_BASE_NS ? 1u : 0u;
    if ((WT_FLASH_OPTSR_CUR & WT_FLASH_SWAP_BANK) != 0u) {
        g_flash_ecc_bank ^= 1u;
    }
    g_flash_ecc_start = (uint32_t)((ns_address & 0x000FFFFFu) >> 4);
    g_flash_ecc_end = (uint32_t)(((ns_address & 0x000FFFFFu) + size + 15u) >> 4);
    g_flash_ecc_detected = 0u;
    WT_FLASH_ECCDETR |= WT_FLASH_ECCD;
    g_flash_ecc_active = 1u;
    wt_flash_barrier();

    for (i = 0u; i < size; i++) {
        data[i] = ((const volatile uint8_t *)source)[i];
    }
    wt_flash_barrier();
    g_flash_ecc_active = 0u;

    if (g_flash_ecc_detected != 0u ||
        (WT_FLASH_ECCDETR & WT_FLASH_ECCD) != 0u) {
        ret = WH_ERROR_ABORTED;
        (void)memset(data, 0, size);
    }
    WT_FLASH_ECCDETR |= WT_FLASH_ECCD;
    wt_flash_barrier();
    wt_irq_restore(primask);

    return ret;
}

