aidangarske/wolfTrust-fork/port/stm32h563/hsm_flash.c
static uintptr_t wt_flash_ns_addr(uintptr_t addr)
{
    return addr & ~0x04000000u;
}

static int wt_flash_range_ok(const wt_hsm_flash_context_t *ctx,
                             uint32_t offset, uint32_t size)
{
    if (ctx == NULL || ctx->sector_size == 0u || ctx->program_unit == 0u) {
        return 0;
    }
    if (offset > ctx->size) {
        return 0;
    }
    if (size > ctx->size - offset) {
        return 0;
    }
    return 1;
}

static void wt_flash_wait_complete(void)
{
    while ((WT_FLASH_SR & WT_FLASH_SR_BSY) != 0u) {
    }
    while ((WT_FLASH_SR & WT_FLASH_SR_DBNE) != 0u) {
    }
}

static void wt_flash_clear_errors(void)
{
    WT_FLASH_CCR = WT_FLASH_CCR_CLR_ALL;
}

static int wt_flash_check_errors(void)
{
    if ((WT_FLASH_SR & WT_FLASH_SR_ALL_ERR) != 0u) {
        wt_flash_clear_errors();
        return WH_ERROR_ABORTED;
    }
    return WH_ERROR_OK;
}

static void wt_flash_unlock(void)
{
    wt_flash_wait_complete();
    if ((WT_FLASH_CR & WT_FLASH_CR_LOCK) != 0u) {
        WT_FLASH_KEYR = WT_FLASH_KEY1;
        wt_flash_barrier();
        WT_FLASH_KEYR = WT_FLASH_KEY2;
        wt_flash_barrier();
        while ((WT_FLASH_CR & WT_FLASH_CR_LOCK) != 0u) {
        }
    }
}

static void wt_flash_lock(void)
{
    wt_flash_wait_complete();
    if ((WT_FLASH_CR & WT_FLASH_CR_LOCK) == 0u) {
        WT_FLASH_CR |= WT_FLASH_CR_LOCK;
    }
}

static void wt_flash_icache_invalidate(void)
{
    if ((WT_ICACHE_CR & WT_ICACHE_CR_EN) != 0u) {
        WT_ICACHE_CR |= WT_ICACHE_CR_CACHEINV;
        while ((WT_ICACHE_SR & WT_ICACHE_SR_BUSYF) != 0u) {
        }
        wt_flash_barrier();
    }
}

/* Confined-keystore trap: the controller-touching callbacks below also run
 * inside the unprivileged keystore partitions, whose MPU domain has no
 * flash-controller access; hop to the privileged SVC dispatcher, which
 * re-enters the same callback with privilege. Only the shared NVM context may
 * take this path — the FWU staging context has its own pinned gate. */
static int wt_hsm_flash_gate(void *context, int sub_op, uint32_t offset,
                             uint32_t size, void *data)
{
    wt_spm_call_t call;
    int rc;

    if (context != (void *)&g_hsm_flash_ctx) {
        return WH_ERROR_BADARGS;
    }
    (void)memset(&call, 0, sizeof(call));
    call.op = WT_SPM_OP_KEYSTORE_FLASH;
    call.call_type = sub_op;
    call.vec_idx = offset;
    call.num_bytes = size;
    call.buffer = data;
    rc = wt_spm_sp_call(&call);
    if (rc != WT_FFM_SUCCESS) {
        g_wt_flash_gate_aborts++;
        if (g_wt_flash_gate_abort_info == 0u) {
            g_wt_flash_gate_abort_info = ((uint32_t)sub_op << 24) |
                                         ((uint32_t)rc & 0x00FFFFFFu);
        }
        return WH_ERROR_ABORTED;
    }
    return call.ret_int;
}

static int wt_hsm_flash_init(void *context, const void *config)
{
    wt_hsm_flash_context_t *ctx = (wt_hsm_flash_context_t *)context;
    const wt_hsm_flash_config_t *cfg =
        (const wt_hsm_flash_config_t *)config;

    if (ctx == NULL || cfg == NULL || cfg->base == 0u || cfg->size == 0u ||
        cfg->sector_size == 0u || cfg->program_unit == 0u ||
        (cfg->size % cfg->sector_size) != 0u ||
        (cfg->sector_size % cfg->program_unit) != 0u) {
        return WH_ERROR_BADARGS;
    }

    ctx->base = cfg->base;
    ctx->size = cfg->size;
    ctx->sector_size = cfg->sector_size;
    ctx->program_unit = cfg->program_unit;
    ctx->write_locked = false;

    return WH_ERROR_OK;
}

static int wt_hsm_flash_cleanup(void *context)
{
    if (context == NULL) {
        return WH_ERROR_BADARGS;
    }
    if (wt_arch_thread_unprivileged()) {
        return wt_hsm_flash_gate(context, WT_SPM_KS_FLASH_CLEANUP, 0u, 0u,
                                 NULL);
    }
    wt_flash_lock();
    return WH_ERROR_OK;
}

static uint32_t wt_hsm_flash_partition_size(void *context)
{
    wt_hsm_flash_context_t *ctx = (wt_hsm_flash_context_t *)context;

    if (ctx == NULL) {
        return 0u;
    }
    return ctx->sector_size;
}

static int wt_hsm_flash_write_lock(void *context, uint32_t offset,
                                   uint32_t size)
{
    wt_hsm_flash_context_t *ctx = (wt_hsm_flash_context_t *)context;
    (void)offset;
    (void)size;

    if (ctx == NULL) {
        return WH_ERROR_BADARGS;
    }
    ctx->write_locked = true;
    return WH_ERROR_OK;
}

static int wt_hsm_flash_write_unlock(void *context, uint32_t offset,
                                     uint32_t size)
{
    wt_hsm_flash_context_t *ctx = (wt_hsm_flash_context_t *)context;
    (void)offset;
    (void)size;

    if (ctx == NULL) {
        return WH_ERROR_BADARGS;
    }
    ctx->write_locked = false;
    return WH_ERROR_OK;
}

static int wt_hsm_flash_read(void *context, uint32_t offset, uint32_t size,
                             uint8_t *data)
{
    wt_hsm_flash_context_t *ctx = (wt_hsm_flash_context_t *)context;

    if (data == NULL && size != 0u) {
        return WH_ERROR_BADARGS;
    }
    if (wt_arch_thread_unprivileged()) {
        return wt_hsm_flash_gate(context, WT_SPM_KS_FLASH_READ, offset, size,
                                 data);
    }
    if (!wt_flash_range_ok(ctx, offset, size)) {
        return WH_ERROR_BADARGS;
    }
    if (size != 0u) {
        return wt_flash_read_checked((const uint8_t *)(ctx->base + offset),
                                     data, size);
    }
    return WH_ERROR_OK;
}

static int wt_hsm_flash_program(void *context, uint32_t offset, uint32_t size,
                                const uint8_t *data)
{
    wt_hsm_flash_context_t *ctx = (wt_hsm_flash_context_t *)context;
    uint32_t written = 0u;
    int ret = WH_ERROR_OK;

    if (data == NULL && size != 0u) {
        return WH_ERROR_BADARGS;
    }
    if (wt_arch_thread_unprivileged()) {
        return wt_hsm_flash_gate(context, WT_SPM_KS_FLASH_PROGRAM, offset,
                                 size, (void *)(uintptr_t)data);
    }
    if (ctx == &g_hsm_flash_ctx) {
        g_wt_flash_prog_calls++;
    }
    if (!wt_flash_range_ok(ctx, offset, size)) {
        if (g_wt_flash_first_err == 0u) {
            g_wt_flash_first_err = 0x01000000u | (uint32_t)(-WH_ERROR_BADARGS);
            g_wt_flash_first_err_off = offset;
        }
        return WH_ERROR_BADARGS;
    }
    if ((offset % ctx->program_unit) != 0u ||
        (size % ctx->program_unit) != 0u) {
        if (g_wt_flash_first_err == 0u) {
            g_wt_flash_first_err = 0x02000000u | (uint32_t)(-WH_ERROR_BADARGS);
            g_wt_flash_first_err_off = offset;
        }
        return WH_ERROR_BADARGS;
    }
    if (size != 0u && ctx->write_locked) {
        if (g_wt_flash_first_err == 0u) {
            g_wt_flash_first_err = 0x03000000u | (uint32_t)(-WH_ERROR_LOCKED);
            g_wt_flash_first_err_off = offset;
        }
        return WH_ERROR_LOCKED;
    }

