aidangarske/wolfTrust-fork/port/stm32h563/hsm_flash.c
    wt_flash_unlock();
    wt_flash_clear_errors();

    while (written < size) {
        uintptr_t dst = ctx->base + offset + written;
        uint32_t word[4];
        volatile uint32_t *flash_word = (volatile uint32_t *)dst;

        (void)memcpy(word, data + written, sizeof(word));

        WT_FLASH_CR |= WT_FLASH_CR_PG;
        flash_word[0] = word[0];
        wt_flash_barrier();
        flash_word[1] = word[1];
        wt_flash_barrier();
        flash_word[2] = word[2];
        wt_flash_barrier();
        flash_word[3] = word[3];
        wt_flash_barrier();
        wt_flash_wait_complete();

        if ((WT_FLASH_SR & WT_FLASH_SR_EOP) != 0u) {
            WT_FLASH_CCR = WT_FLASH_SR_EOP;
        }
        WT_FLASH_CR &= ~WT_FLASH_CR_PG;

        if ((WT_FLASH_SR & WT_FLASH_SR_ALL_ERR) != 0u &&
                g_wt_flash_first_err == 0u) {
            g_wt_flash_first_err = 0x04000000u;
            g_wt_flash_first_err_off = offset + written;
            g_wt_flash_first_err_sr = WT_FLASH_SR;
        }
        ret = wt_flash_check_errors();
        if (ret != WH_ERROR_OK) {
            break;
        }
        written += ctx->program_unit;
    }

    WT_FLASH_CR &= ~WT_FLASH_CR_PG;
    wt_flash_lock();
    wt_flash_icache_invalidate();
    return ret;
}

static int wt_hsm_flash_erase(void *context, uint32_t offset, uint32_t size)
{
    wt_hsm_flash_context_t *ctx = (wt_hsm_flash_context_t *)context;
    uint32_t start;
    uint32_t end;

    if (wt_arch_thread_unprivileged()) {
        return wt_hsm_flash_gate(context, WT_SPM_KS_FLASH_ERASE, offset, size,
                                 NULL);
    }
    if (ctx == &g_hsm_flash_ctx) {
        g_wt_flash_erase_calls++;
    }
    if (!wt_flash_range_ok(ctx, offset, size)) {
        return WH_ERROR_BADARGS;
    }
    if ((offset % ctx->sector_size) != 0u ||
        (size % ctx->sector_size) != 0u) {
        return WH_ERROR_BADARGS;
    }
    if (size != 0u && ctx->write_locked) {
        return WH_ERROR_LOCKED;
    }
    if (size == 0u) {
        return WH_ERROR_OK;
    }

    start = offset;
    end = offset + size;

    wt_flash_unlock();
    wt_flash_clear_errors();

    while (start < end) {
        uintptr_t ns_addr = wt_flash_ns_addr(ctx->base + start);
        uint32_t sector = (uint32_t)((ns_addr - WT_FLASH_NS_BASE) /
                                     ctx->sector_size);
        uint32_t bank = 0u;
        uint32_t sector_in_bank = sector;
        uint32_t cr;

        if (ns_addr >= WT_FLASH_BANK2_BASE_NS && ns_addr <= WT_FLASH_TOP_NS) {
            bank = 1u;
            sector_in_bank = sector - WT_FLASH_BANK_SECTORS;
        }
        if ((WT_FLASH_OPTSR_CUR & WT_FLASH_SWAP_BANK) != 0u) {
            bank ^= 1u;
        }

        cr = WT_FLASH_CR & ~((WT_FLASH_CR_PNB_MASK << WT_FLASH_CR_PNB_SHIFT) |
                             WT_FLASH_CR_SER | WT_FLASH_CR_BER |
                             WT_FLASH_CR_PG | WT_FLASH_CR_MER |
                             WT_FLASH_CR_BKSEL);
        cr |= (sector_in_bank << WT_FLASH_CR_PNB_SHIFT) |
              WT_FLASH_CR_SER |
              (bank != 0u ? WT_FLASH_CR_BKSEL : 0u);
        WT_FLASH_CR = cr;
        wt_flash_barrier();
        WT_FLASH_CR |= WT_FLASH_CR_STRT;
        wt_flash_wait_complete();

        if ((WT_FLASH_SR & WT_FLASH_SR_ALL_ERR) != 0u &&
                g_wt_flash_first_err == 0u) {
            g_wt_flash_first_err = 0x05000000u;
            g_wt_flash_first_err_off = start;
            g_wt_flash_first_err_sr = WT_FLASH_SR;
        }
        if (wt_flash_check_errors() != WH_ERROR_OK) {
            WT_FLASH_CR &= ~WT_FLASH_CR_SER;
            wt_flash_lock();
            wt_flash_icache_invalidate();
            return WH_ERROR_ABORTED;
        }
        start += ctx->sector_size;
    }

    WT_FLASH_CR &= ~WT_FLASH_CR_SER;
    wt_flash_lock();
    wt_flash_icache_invalidate();
    return WH_ERROR_OK;
}

static int wt_hsm_flash_verify(void *context, uint32_t offset, uint32_t size,
                               const uint8_t *data)
{
    wt_hsm_flash_context_t *ctx = (wt_hsm_flash_context_t *)context;
    uint8_t flash_data[16];
    uint32_t checked = 0u;
    int ret;

    if (data == NULL && size != 0u) {
        return WH_ERROR_BADARGS;
    }
    if (wt_arch_thread_unprivileged()) {
        return wt_hsm_flash_gate(context, WT_SPM_KS_FLASH_VERIFY, offset,
                                 size, (void *)(uintptr_t)data);
    }
    if (!wt_flash_range_ok(ctx, offset, size)) {
        return WH_ERROR_BADARGS;
    }
    while (checked < size) {
        uint32_t chunk = size - checked;

        if (chunk > sizeof(flash_data)) {
            chunk = sizeof(flash_data);
        }
        ret = wt_flash_read_checked(
                (const uint8_t *)(ctx->base + offset + checked), flash_data,
                chunk);
        if (ret != WH_ERROR_OK) {
            return ret;
        }
        if (memcmp(flash_data, data + checked, chunk) != 0) {
            return WH_ERROR_NOTVERIFIED;
        }
        checked += chunk;
    }
    return WH_ERROR_OK;
}

static int wt_hsm_flash_blank_check(void *context, uint32_t offset,
                                    uint32_t size)
{
    wt_hsm_flash_context_t *ctx = (wt_hsm_flash_context_t *)context;
    uint8_t flash_data[16];
    uint32_t checked = 0u;
    uint32_t i;
    int ret;

    if (wt_arch_thread_unprivileged()) {
        return wt_hsm_flash_gate(context, WT_SPM_KS_FLASH_BLANKCHECK, offset,
                                 size, NULL);
    }
    if (!wt_flash_range_ok(ctx, offset, size)) {
        return WH_ERROR_BADARGS;
    }
    while (checked < size) {
        uint32_t chunk = size - checked;

        if (chunk > sizeof(flash_data)) {
            chunk = sizeof(flash_data);
        }
        ret = wt_flash_read_checked(
                (const uint8_t *)(ctx->base + offset + checked), flash_data,
                chunk);
        if (ret != WH_ERROR_OK) {
            return ret;
        }
        for (i = 0u; i < chunk; i++) {
            if (flash_data[i] != 0xFFu) {
                return WH_ERROR_NOTBLANK;
            }
        }
        checked += chunk;
    }
    return WH_ERROR_OK;
}

const whFlashCb g_wt_hsm_flash_cb = {
    .Init = wt_hsm_flash_init,
    .Cleanup = wt_hsm_flash_cleanup,
    .PartitionSize = wt_hsm_flash_partition_size,
    .WriteLock = wt_hsm_flash_write_lock,
    .WriteUnlock = wt_hsm_flash_write_unlock,
    .Read = wt_hsm_flash_read,
    .Program = wt_hsm_flash_program,
    .Erase = wt_hsm_flash_erase,
    .Verify = wt_hsm_flash_verify,
    .BlankCheck = wt_hsm_flash_blank_check,
};

void *wt_hsm_flash_context(void)
{
    return &g_hsm_flash_ctx;
}

const void *wt_hsm_flash_config(void)
{
    return &g_hsm_flash_cfg;
}

int wt_hsm_flash_format(void)
{
    /* Erase the whole vault NVM region so wh_Nvm_Init rebuilds a blank store.
     * The context carries the geometry; the erase already honors sector
     * alignment and the write-lock. Region size is a whole number of sectors. */
    return wt_hsm_flash_erase(&g_hsm_flash_ctx, 0u, g_hsm_flash_ctx.size);
}

/* SERVICE_FWU staging into the wolfBoot update partition (WT-FWU-0002). The
 * privileged FWU coroutine erases each target sector lazily, programs the
 * candidate, and verifies every block against the memory-mapped secure flash.
 * install() arms wolfBoot's real WRITEONCE update trigger in the UPDATE
 * partition trailer (wt_fwu_wolfboot_arm_trailer), so the next boot swaps the
 * staged image; the swapped image is still gated by authenticated launch and
 * anti-rollback at boot (P6-S6). */

static const wt_hsm_flash_config_t g_fwu_flash_cfg = {
    .base = WT_FWU_UPDATE_FLASH_BASE_S,
    .size = WT_FWU_UPDATE_FLASH_SIZE,
    .sector_size = WT_FLASH_SECTOR_SIZE,
    .program_unit = 16u,
};
static wt_hsm_flash_context_t g_fwu_flash_ctx;
static uint32_t g_fwu_erased_sectors;

